{
    "tags": {
        "course": {
            "label": "Course",
            "color": "#01ad62ff"
        },
        "entrepreneur": {
            "label": "Entrepreneur",
            "color": "#e2ba1cff"
        },
        "unity": {
            "label": "Unity",
            "color": "#cfc2b2"
        },
        "ia": {
            "label": "IA",
            "color": "#78f6ff"
        },
        "blender": {
            "label": "Blender",
            "color": "#f5971d"
        },
        "tiktok": {
            "label": "Tiktok",
            "color": "#78f6ff"
        },
        "insta": {
            "label": "Instagram",
            "color": "#e63ed8"
        },
        "app": {
            "label": "App",
            "color": "#e63e5d"
        },
        "web": {
            "label": "Web",
            "color": "#5f3ee6"
        },
        "vg": {
            "label": "VideoGame",
            "color": "#67d672"
        }
    },
    "projects": {
        "wawedo": {
            "title": "Wawedo",
            "tagline": "Communauté pour lancer des projets innovants",
            "date": "2025-09",
            "status": "in_progress",
            "description": "Wawedo est un projet lancé sur TikTok pour rassembler des personnes motivées et créatives, afin de former une communauté capable de participer à des idées et de lancer des projets innovants. J’ai créé un compte TikTok (une dizaine de vidéos) ainsi qu’un Discord pour centraliser la communauté. Une série de vidéos intitulée « Why not » a été produite pour présenter des idées parfois folles et questionner leur faisabilité, avec un message central : pourquoi ne pas les réaliser ? L’objectif était d’amener les gens à prendre conscience que leurs idées peuvent devenir des projets concrets et intéressants.",
            "tags": [
                "tiktok",
                "entrepreneur"
            ],
            "sections": [
                {
                    "title": "Ce que j’ai fait",
                    "content": "Création du concept, lancement du compte TikTok, production d’une dizaine de vidéos, création et structuration du Discord."
                },
                {
                    "title": "Tech / Outils",
                    "content": "TikTok, Discord, création de contenu, community building."
                }
            ],
            "links": [
                {
                    "label": "Tiktok",
                    "url": "https://www.tiktok.com/@wawedo_off"
                },
                {
                    "label": "Discord",
                    "url": "https://discord.gg/RjJh6sFJtd"
                }
            ],
            "media": [
                {
                    "type": "video",
                    "src": "/videos/wawedo.mp4",
                    "alt": "Why not 1"
                }
            ]
        },
        "unknown": {
            "title": "Unknown",
            "tagline": "Jeu vidéo secret en cours de développement",
            "status": "in_progress",
            "date": "2025-06",
            "description": "Unknown est un projet de jeu vidéo actuellement en cours de développement. Le projet reste volontairement discret pour le moment, mais l’objectif est de construire une expérience originale, avec une forte direction créative et une progression pensée sur le long terme.",
            "tags": [
                "unity",
                "entrepreneur",
                "vg"
            ],
            "sections": [
                {
                    "title": "Ce que j’ai fait",
                    "content": "Game design, prototypage, développement en cours, mise en place de la structure projet et des bases de production."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Unity, 3D, game dev (détails volontairement limités pour l’instant)."
                }
            ]
        },
        "pinkcc": {
            "title": "PINKCC Challenge 2025",
            "tagline": "IA & imagerie médicale pour améliorer le diagnostic du cancer de l’ovaire",
            "date": "2025-01",
            "status": "done",
            "description": "Participation au PINKCC Challenge 2025, un challenge scientifique international visant à mettre l’intelligence artificielle au service de la santé des femmes. Pendant 10 semaines, les équipes ont travaillé sur des modèles de segmentation tumorale à partir d’images médicales, afin d’améliorer le diagnostic du cancer de l’ovaire. La finale s’est tenue à l’ICM (Institut du Cancer de Montpellier), dans une ambiance à la fois très exigeante scientifiquement et humaine.",
            "tags": [
                "ia"
            ],
            "links": [
                {
                    "label": "GitHub",
                    "url": "https://github.com/OIIA-OIIA/PinkCC"
                },
                {
                    "label": "ICM",
                    "url": "https://montpellier-cancer.com/pinkcc-challenge-2025/"
                }
            ],
            "sections": [
                {
                    "title": "Ce que j’ai fait",
                    "content": "Participation active au développement du pipeline de segmentation d’images médicales au sein de l’équipe OIIA OIIA. Travail sur la préparation des données (lecture de volumes .nii.gz, extraction de coupes 2D), implémentation et expérimentation d’un modèle U-Net pour la segmentation tumorale, réglage des paramètres d’entraînement et analyse qualitative des résultats via la visualisation des prédictions. Contribution aux itérations du modèle et à la préparation du rendu final présenté lors de la finale du challenge."
                },
                {
                    "title": "Approche & pipeline IA",
                    "content": "Mise en place d’un pipeline complet de segmentation supervisée : chargement des données avec nibabel, création d’un Dataset PyTorch personnalisé, normalisation et transformations des images, entraînement d’un modèle U-Net avec fonction de perte Dice Loss pour gérer le déséquilibre des classes, puis visualisation des prédictions (image, masque réel, masque prédit) afin d’évaluer qualitativement les performances."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Python, PyTorch, U-Net, Dice Loss, imagerie médicale, segmentation d’images, fichiers .nii.gz, nibabel, data science, travail collaboratif en équipe."
                },
                {
                    "title": "Perspectives",
                    "content": "Pistes d’amélioration identifiées : ajout d’une phase de validation quantitative (Dice score, précision, rappel), entraînement sur un plus grand volume de données et sur GPU, amélioration du modèle (U-Net plus profond, data augmentation), et prise en compte de volumes 3D complets pour une segmentation plus fine."
                }
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/images/pinkcc.jpg",
                    "alt": "Pink CC"
                }
            ]
        },
        "pxl": {
            "title": "PXL",
            "tagline": "Ateliers et parcours pour rendre l’informatique accessible",
            "status": "paused",
            "date": "2025-06",
            "description": "PXL est une initiative pensée pour transmettre le savoir et rendre l’informatique plus accessible à des publics variés : jeunes, filles/femmes, personnes en reconversion, et personnes âgées. L’idée est de proposer des ateliers d’initiation, des cours plus poussés, et des parcours intensifs sur plusieurs mois — jusqu’à permettre à des personnes partant de zéro d’acquérir un niveau suffisant pour viser une poursuite d’études (ex : intégration d’un master) ou une montée en compétences solide.",
            "tags": [
                "entrepreneur",
                "web",
                "ia",
                "vg"
            ],
            "links": [
                {
                    "label": "website",
                    "url": "https://nuagecloud43.wixsite.com/p-x-l"
                },
                {
                    "label": "website²",
                    "url": "https://pxl-rho.vercel.app/"
                },
                {
                    "label": "Présentation",
                    "url": "https://gamma.app/docs/Ateliers-Numeriques-Pour-Tous-a0pykuxc0ruenmc?mode=doc"
                }
            ],
            "sections": [
                {
                    "title": "Contexte",
                    "content": "PXL est né de la volonté de démocratiser l’accès à l’informatique, au jeu vidéo et à l’intelligence artificielle auprès de publics variés (jeunes, femmes, personnes en reconversion ou seniors), via une approche pédagogique progressive, inclusive et concrète."
                },
                {
                    "title": "Ateliers proposés",
                    "content": "Le projet PXL s’articulait autour d’ateliers pratiques et accessibles, pensés pour partir de zéro et apprendre en faisant :\n\n• Logiciel & impression 3D : découverte de Blender et impression de créations via imprimante 3D.\n• Intelligence Artificielle & Machine Learning : compréhension des bases de l’IA à travers un exemple ludique (type Flappy Bird) pour visualiser les mécanismes d’apprentissage.\n• Deep Learning : introduction aux réseaux de neurones et démonstration de la reconnaissance de chiffres par une IA.\n• Python : apprentissage des bases de la programmation et création d’un petit jeu.\n• Web (React) : création des premières pages web interactives.\n• Application mobile (React Native) : conception et développement d’une première application mobile."
                },
                {
                    "title": "Ce que j’ai fait",
                    "content": "Conception du projet pédagogique, définition des ateliers et de leur progression, réflexion sur les parcours courts et longs (initiation, approfondissement, parcours intensifs), ainsi que sur les objectifs de montée en compétences et d’orientation possible vers des formations avancées."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Python, React, React Native, Blender, impression 3D, bases en IA et deep learning, pédagogie et vulgarisation technique."
                }
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/images/pxl.png",
                    "alt": "PXL"
                }
            ]
        },
        "duaphin": {
            "title": "Duaphin",
            "tagline": "Collection de modèles 3D interactifs avec système de rareté",
            "date": "2021-06",
            "status": "paused",
            "description": "Duaphin est un projet imaginé dès 2021, à la découverte de Three.js puis approfondi plus récemment avec React Three Fiber. L’idée était de créer une application web permettant de collectionner des modèles 3D originaux que je réalise, avec un système de rareté et de mise en valeur interactive.",
            "tags": [
                "entrepreneur",
                "web",
                "blender"
            ],
            "links": [
                {
                    "label": "CDA 2023",
                    "url": "/documents/CDA_2023.pdf"
                }
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/images/duaphin.png",
                    "alt": "Duaphin"
                }
            ],
            "sections": [
                {
                    "title": "Ce que j’ai fait",
                    "content": "Conception de l’idée, réflexion sur l’expérience utilisateur, exploration de Three.js et React Three Fiber, création de modèles 3D avec Blender."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Three.js, React Three Fiber, Blender, web 3D."
                }
            ]
        },
        "plush-n-peek": {
            "title": "Plush 'n' Peek",
            "tagline": "Jeu coopératif asymétrique basé sur la communication",
            "date": "2023-11",
            "status": "stopped",
            "description": "Plush 'n' Peek est un projet de jeu vidéo développé dans le cadre du master à Epitech. Pendant un an et demi, une équipe passée de 3 à 9 personnes a travaillé sur un jeu coopératif où deux joueurs incarnent des peluches dans une usine. Suite à une défaillance visuelle, chaque joueur ne perçoit pas les mêmes éléments de l’environnement, ce qui les oblige à communiquer pour résoudre des énigmes, réussir des challenges et vaincre des boss.",
            "tags": [
                "unity",
                "vg"
            ],
            "links": [
                {
                    "label": "Trailer",
                    "url": "https://www.youtube.com/watch?v=34b7SQuMP2A"
                },
                {
                    "label": "Démo",
                    "url": "https://youtu.be/mfvZHeJvfzE"
                }
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/images/pnp.png",
                    "alt": "Plush 'n' Peek cover"
                }
            ],
            "sections": [
                {
                    "title": "Ce que j’ai fait",
                    "content": "Participation au game design, au développement Unity, à la conception des mécaniques coopératives et à la coordination au sein d’une équipe de grande taille."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Unity, C#, game design, travail en équipe, gestion de projet."
                }
            ]
        },
        "mind7": {
            "title": "Mind7",
            "tagline": "Application mobile de suivi émotionnel et d’habitudes positives",
            "date": "2025-03",
            "status": "in_progress",
            "description": "Mind7 est une application mobile dédiée au suivi des émotions et des habitudes, avec pour objectif d’aider les utilisateurs à améliorer leur santé mentale et leur rapport au quotidien. Mind7 propose une approche plus douce et ludique du bien-être mental et du développement personnel. Le projet vise à encourager une vision plus positive, à valoriser les petites victoires et à accompagner la mise en place d’habitudes saines sur le long terme.",
            "tags": [
                "entrepreneur",
                "app"
            ],
            "links": [
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/images/mind7.png",
                    "alt": "Mind7 app cover"
                }
            ],
            "sections": [
                {
                    "title": "Ce que j’ai fait",
                    "content": "Définition du concept, réflexion UX/UI, structuration des fonctionnalités (mood tracking, habitudes, progression), et prototypage de l’application."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Application mobile, UX/UI, logique produit, outils à préciser selon l’implémentation finale."
                }
            ]
        },
        "decblender": {
            "title": "DecBlender",
            "tags": [
                "blender",
                "insta"
            ]
        },
        "octoblender": {
            "title": "OctoBlender",
            "tags": [
                "blender",
                "insta"
            ]
        },
        "unity-learn-course": {
            "title": "Unity Learn",
            "tags": [
                "course",
                "vg"
            ]
        },
        "reinforcement-learning-course": {
            "title": "Reinforcement Learning",
            "tags": [
                "course",
                "ia"
            ]
        },
        "fun-mooc-machine-learning": {
            "title": "Machine Learning",
            "tags": [
                "course",
                "ia"
            ]
        },
        "hector-influenceur": {
            "title": "Hector l'influenceur",
            "tags": [
                "insta"
            ]
        },
        "grimoire": {
            "title": "Grimoire",
            "tagline": "Catalogue digital connecté aux outils métiers",
            "date": "2024-05",
            "status": "stopped",
            "description": "Grimoire est une application pensée pour aider les entreprises à présenter leurs produits et services à travers un book digital interactif. Connectée à un ERP, l’application permettait également d’accéder à des fonctionnalités métier comme la consultation des stocks, la prise de commandes ou l’accompagnement des équipes commerciales sur le terrain.",
            "tags": [
                "app",
                "entrepreneur"
            ],
            "links": [
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/images/grimoire.png",
                    "alt": "Grimoire cover"
                }
            ],
            "sections": [
                {
                    "title": "Contexte",
                    "content": "Projet orienté B2B visant à moderniser la présentation produit et à faciliter le travail des équipes commerciales."
                },
                {
                    "title": "Ce que j’ai fait",
                    "content": "Conception du produit, définition des fonctionnalités clés, réflexion sur l’intégration ERP et l’expérience utilisateur."
                },
                {
                    "title": "Tech / Outils",
                    "content": "Application métier, UX produit, intégration ERP (conceptuelle)."
                }
            ]
        },
        "tlc": {
            "title": "Trouve le code",
            "tags": [
                "web",
                "vg"
            ]
        },
        "hexa": {
            "title": "Hexa",
            "tags": [
                "web",
                "vg"
            ]
        },
        "p2p": {
            "title": "Pomme2pain",
            "tags": [
                "web",
                "vg"
            ]
        },
        "r3f": {
            "title": "ThreeJs Journey",
            "tags": [
                "web",
                "course",
                "blender"
            ]
        },
        "chauddevant": {
            "title": "Chaud Devant !",
            "tags": [
                "unity",
                "vg"
            ]
        },
        "samaritain": {
            "title": "Samaritain",
            "tags": [
                "app",
                "web",
                "entrepreneur"
            ]
        },
        "safyr": {
            "title": "SAFYR",
            "tagline": "Plateforme web + app pour gestion terrain",
            "date": "2025-11",
            "status": "in_progress",
            "description": "Projet test pour valider le rendu de la page projet : une plateforme type dashboard (glassmorphism) avec gestion de données, modules, et analytics. L’objectif est de vérifier l’affichage des sections, des liens et de la galerie média.",
            "tags": [
                "app",
                "web",
                "entrepreneur"
            ],
            "links": [
                {
                    "label": "Live",
                    "url": "https://example.com"
                },
                {
                    "label": "GitHub",
                    "url": "https://github.com/username/repo"
                },
                {
                    "label": "Figma",
                    "url": "https://figma.com/file/xxxx"
                }
            ],
            "media": [
                {
                    "type": "image",
                    "src": "/projects/safyr/cover.png",
                    "alt": "Dashboard SAFYR"
                },
                {
                    "type": "image",
                    "src": "/projects/safyr/screen-1.png",
                    "alt": "Module analytics"
                },
                {
                    "type": "video",
                    "src": "https://www.youtube.com/embed/dQw4w9WgXcQ",
                    "alt": "Demo vidéo"
                }
            ],
            "sections": [
                {
                    "title": "Contexte",
                    "content": "Créé pour tester une UI de dashboard scientifique : cartes modulaires, filtres, tags, et pages projet dynamiques."
                },
                {
                    "title": "Ce que j’ai fait",
                    "content": "Structuration des données via portfolio.json, routing /work/:id, UI cards, recherche + filtres, et gabarit de page projet."
                },
                {
                    "title": "Tech",
                    "content": "React + Router, CSS glassmorphism, data-driven rendering via JSON."
                }
            ]
        }
    }
}